app/controllers/contact_lists_controller.rb

  def index
    @contact_lists = ContactList.all
---
SELECT `contact_lists`.* FROM `contact_lists`

  def create
    @contact_list = ContactList.new(contact_list_params)
    if @contact_list.save
---
INSERT INTO `contact_lists` (`name`, `created_at`, `updated_at`) VALUES ('sdfgh', '2019-02-06 08:21:13', '2019-02-06 08:21:13')

  def update
    if @contact_list.update(contact_list_params)
      @contact_list.contact_lists_contacts.delete_all
---
UPDATE `contact_lists` SET `name` = 'sdfgh', `updated_at` = '2019-02-06 08:04:30' WHERE `contact_lists`.`id` = 1
DELETE FROM `contact_lists_contacts` WHERE `contact_lists_contacts`.`contact_list_id` = 11

  def destroy
    @contact_list.contact_lists_contacts.delete_all
---
DELETE FROM `contact_lists_contacts` WHERE `contact_lists_contacts`.`contact_list_id` = 11

  def add_contact_lists_contacts(contact_list, contact_ids)
    contact_ids = contact_ids.split ","
    contact_ids.each do |contact_id|
      contact = Contact.find(contact_id)
      contact_list.contact_lists_contacts.create(contact: contact)
---
SELECT  `contacts`.* FROM `contacts` WHERE `contacts`.`id` = 1 LIMIT 1
INSERT INTO `contact_lists_contacts` (`contact_id`, `contact_list_id`) VALUES (1, 15)

    def set_contact_list
      @contact_list = ContactList.find(params[:id])
---
SELECT  `contact_lists`.* FROM `contact_lists` WHERE `contact_lists`.`id` = 11 LIMIT 1