app/controllers/contacts_controller.rb

SELECT `contacts`.* FROM `contacts`
---
  def index
    @contacts = Contact.all

INSERT INTO `contacts` (`name`, `email`, `created_at`, `updated_at`) VALUES ('qwertyui', 'qwerty@gmail.com', '2019-02-06 07:17:12', '2019-02-06 07:17:12')
---
  def create
    @contact = Contact.new(contact_params)

    if @contact.save

UPDATE `contacts` SET `name` = 'sdfghnjkdsadadsa', `email` = 'qwesdrtsy@gmail.com', `updated_at` = '2019-02-06 08:41:03' WHERE `contacts`.`id` = 2
---
  def update
    if @contact.update(contact_params)

DELETE FROM `contacts` WHERE `contacts`.`id` = 1
---
  def destroy
    @contact.destroy

SELECT  `contacts`.* FROM `contacts` WHERE `contacts`.`id` = 2 LIMIT 1
---
    def set_contact
      @contact = Contact.find(params[:id])